
# Задание №3.
# Пользователь с клавиатуры вводит N целых чисел, необходимо вывести на экран только уникальные числа (не повторяющиеся).

numbers = set(input("Введите последовательность чисел: ").split())

print(numbers)
